app/views/questions/most_popular.html.erb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---

<%question = Question.find_by(id: "#{most_popular}") %>