app/views/groups/index.html.erb

<script type="text/javascript" charset="utf-8">
$(function () {
  $(".js-more").on('click', function() {
    // get the id from the data attribute
    var id = $(this).data("id");
    $.get(" /groups/" + id + ".json", function(data) {
      var group_questions = data.group.questions.forEach(function(question) {
        html = ''
        html += '<li> ¿' + question.query + '?'
        $('.questions-group-' + id).append(html)

        var answers = question.answers
        $.each(answers, function(index, answer){
            var yesArry = [];
            var noArry = [];
             if (answer.input === "yes") {
              yesArry.push(answer);
             } else if (answer.input === "no") {
              noArry.push(answer);
            };
            if (yesArry.length == noArry.length) {
              html = ''
---
SELECT "groups".* FROM "groups"