app/views/groups/my_groups.html.erb

  <% memberships.each do |membership| %>
  <% group = Group.find_by(:id => membership.id)%>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]