app/views/groups/show.html.erb

<% @group.memberships.each do |membership| %>
  <% member = User.find_by(:id => membership.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]