app/views/users/show.html.erb

SELECT "questions".* FROM "questions" INNER JOIN "answers" ON "questions"."id" = "answers"."question_id" WHERE "answers"."user_id" = ?  [["user_id", 10]]
---

<% @user.questions.each do |question| %>