app/controllers/answers_controller.rb

  def new
    @question =  Question.find_by(id: params[:question_id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def show
    @question = Question.find_by(id: params[:question_id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @question =  Question.find_by(id: params[:question_id])
    @answer = @question.answers.build(answer_params)
    @answer.user_id = current_user.id #session[:user_id]
    if
      @answer.save
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "answers" ("input", "question_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["input", "yes"], ["question_id", 1], ["created_at", 2016-08-20 20:23:04 UTC], ["updated_at", 2016-08-20 20:23:04 UTC], ["user_id", 1]]