app/controllers/groups_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def update
    #raise params.inspect
    @user = User.find_by(:id => params[:group][:user_id])