app/controllers/groups_controller.rb

  def create
    #raise params.inspect
    @group = Group.create(group_params)
    @group.memberships.build(:user_id => params[:group][:user_id], :group_id => @group.id).save
---
INSERT INTO "groups" ("name") VALUES (?)  [["name", "team2"]]
INSERT INTO "group_memberships" ("member_type", "member_id", "group_type", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["member_type", "User"], ["member_id", 2], ["group_type", "Group"], ["group_id", 10], ["created_at", 2016-09-10 18:23:10 UTC], ["updated_at", 2016-09-10 18:23:10 UTC]]

  def update
    #raise params.inspect
    @group = Group.find_by(:id => params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def show
    @user = current_user
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]