app/controllers/questions_controller.rb

  def create
    #raise params.inspect
    @question = current_user.asked_questions.build(question_params)
    @group = Group.find_by(:id => params[:question][:group_id])
    if
      @question.save
      @group_question = GroupQuestion.create(:group_id => @group.id, :question_id => @question.id)
      #redirect_to questions_path
      render json: @question, status: 201
    else
      flash[:error] = "#{@question.errors.full_messages.join(" & ")}"
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "questions" ("query", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["query", "does this work?"], ["created_at", 2016-08-20 20:22:25 UTC], ["updated_at", 2016-08-20 20:22:25 UTC], ["user_id", 1]]
SELECT "questions".* FROM "questions" INNER JOIN "answers" ON "questions"."id" = "answers"."question_id" WHERE "answers"."user_id" = ?  [["user_id", 7]]

  def show
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @question = Question.find_by(id: params[:id])
    @answers = Answer.where(question_id: @question.id)
    @question.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 20]]
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 19]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 20]]

  def most_popular
    question_id = Question.most_popular
    @question = Question.find_by(:id => question_id)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]