app/controllers/questions_controller.rb

  def index
    #if you're not logged in you can't see this, goto login page
    #raise params.inspect
    if current_user.nil?
      redirect_to new_user_session_path
    else
    @questions = Question.all
---
SELECT "questions".* FROM "questions"