app/controllers/sessions_controller.rb

  def create
    if auth_hash = request.env["omniauth.auth"]
      user = User.find_or_create_by_omniauth(auth_hash) #=> class method in user.rb
      session[:user_id] = user.id
      redirect_to root_path
    else
      #normal login via username and password
      user = User.find_by(:email => params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "myemail@email.com"], ["LIMIT", 1]]