app/controllers/users_controller.rb

SELECT "answers".* FROM "answers" WHERE "answers"."user_id" = ?  [["user_id", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = current_user #User.find_by(:id => params[:id])
    @user_questions = @user.asked_questions
    @answers = Answer.where(:user_id => @user.id)